In [17]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv('Employee.csv')

In [3]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [4]:
df.shape

(4653, 9)

In [6]:
#Average Age 
df['Age'].mean()

29.393294648613796

In [10]:
#Most Common City
df['City'].value_counts()

City
Bangalore    2228
Pune         1268
New Delhi    1157
Name: count, dtype: int64

In [11]:
#Most Common Education
df['Education'].value_counts()

Education
Bachelors    3601
Masters       873
PHD           179
Name: count, dtype: int64

In [16]:
df['JoiningYear'].value_counts()

JoiningYear
2017    1108
2015     781
2014     699
2013     669
2016     525
2012     504
2018     367
Name: count, dtype: int64

In [23]:
df.sample(10)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
3556,Masters,2018,New Delhi,3,31,Female,Yes,2,1
698,Bachelors,2017,New Delhi,3,27,Female,Yes,5,0
447,Bachelors,2013,Pune,2,25,Male,No,3,1
4004,Bachelors,2015,Bangalore,3,34,Male,No,4,0
505,Bachelors,2018,Pune,3,26,Male,No,4,1
878,Bachelors,2017,Bangalore,2,27,Male,No,5,0
2249,Bachelors,2012,Bangalore,3,29,Male,Yes,2,0
1839,PHD,2017,Bangalore,3,24,Female,No,2,0
1623,Bachelors,2012,Pune,3,26,Male,No,4,0
4081,Bachelors,2014,Pune,3,27,Male,No,5,1

In [21]:
df.isnull().any()

Education                    False
JoiningYear                  False
City                         False
PaymentTier                  False
Age                          False
Gender                       False
EverBenched                  False
ExperienceInCurrentDomain    False
LeaveOrNot                   False
dtype: bool

In [22]:
df.duplicated().sum()

1889

In [30]:
df['Age'].mean()

29.393294648613796

In [31]:
df['Age'].median()

28.0

In [32]:
df['Age'].min()

22

In [33]:
df['Age'].max()

41

In [34]:
df['Age'].std()

4.826087009126047